{
  "id": "nn_cnn_1d_sct_compressed_nrs24_hog_100/e5744d9d0c0bfb77fdfaab12c98293a46819161a/rec/rec_d9a853a806a73d0d1f12544378fd9c69c3b2139a_e38.report",
  "timestamp": "2020-12-29T20:54:22Z",
  "accuracy": 0.7,
  "loss": 0.6122682293091202,
  "correct": 56,
  "incorrect": 24,
  "total": 80,
  "confusion": {
    "B2": {
      "B2": 11,
      "B3": 5,
      "B4": 2,
      "UPS": 2
    },
    "B3": {
      "B3": 12,
      "B2": 6,
      "B4": 0,
      "UPS": 2
    },
    "B4": {
      "B4": 15,
      "B2": 2,
      "B3": 1,
      "UPS": 2
    },
    "UPS": {
      "UPS": 18,
      "B2": 1,
      "B3": 1,
      "B4": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt1_16_06_20_015_062571.36_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt1_16_06_20_029_475729.90_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_12_018_048697.67_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_25_016_029926.02_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt2_16_07_04_023_185784.60_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt3_16_07_11_009_337328.00_B4.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt8_16_07_07_020_066614.52_B4.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt1_16_06_07_058_000797.01_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt4_16_06_23_057_154843.80_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_19_071_156201.00_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_23_025_082606.90_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt5_16_07_12_021_2_254170.30_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/T_BCI_E1_Jt1_15_06_13_016_000795.64_UPS.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt1_16_06_20_015_062447.76_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_12_018_017885.91_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt2_16_07_04_023_185898.80_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_20_017_007321.50_B2.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/B4_C_TR_Jt2_16_06_02_044_000230.68_B4.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt3_16_07_06_006_089794.53_B4.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt2_16_06_02_044_Buzz2_000257.50_B4.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_18_007_001985.61_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_15_047_013379.50_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_19_071_156089.90_B3.htk",
    "simple_call_test/audio/label_variable/nr24/sr500000_w100_wHam/hog/T_BCI_E1_Jt1_15_06_13_016_000112.63_UPS.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:04:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 24,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.3
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 2
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "cnn_1d_sct_compressed_nrs24_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  43,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "conv1d_input"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d",
                "trainable": true,
                "batch_input_shape": [
                  null,
                  43,
                  288
                ],
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_1",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_2",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_2",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Flatten",
              "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 4,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": false,
              "dataset_name": null,
              "padded_left": false
            }
          },
          {
            "task": "NoiseReduceTask",
            "props": {
              "sensitivity": 24,
              "noise": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "DurationLengthFilter",
                  "props": {
                    "min_duration_length": 0.022
                  }
                },
                {
                  "task": "MinCountLabelFilter",
                  "props": {
                    "min_count": 50
                  }
                },
                {
                  "task": "SilentAudioTask",
                  "props": {
                    "max_length": 0.3
                  }
                },
                {
                  "task": "NoiseProfileTask",
                  "props": {}
                }
              ]
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 2
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_cnn_1d_sct_compressed_nrs24_hog_100/e5744d9d0c0bfb77fdfaab12c98293a46819161a/best_val_acc_e038_v0.8.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}