{
  "id": "nn_cnn_1d_sct_padded_nrs0xpps5000h512_hog_100/dca2ab62da7b68ef157cd66056013328da27a219/rec/rec_dfa9185d4e6a42419f61c2db75905ccaeb64e35c_e64.report",
  "timestamp": "2020-11-18T02:47:29Z",
  "accuracy": 0.8181818181818182,
  "loss": 0.6102942444877013,
  "correct": 108,
  "incorrect": 24,
  "total": 132,
  "confusion": {
    "B2": {
      "B2": 15,
      "B3": 2,
      "B4": 5,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "B3": {
      "B3": 17,
      "B2": 4,
      "B4": 1,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "B4": {
      "B4": 17,
      "B2": 1,
      "B3": 3,
      "UPS": 1,
      "VS": 0,
      "VSV": 0
    },
    "UPS": {
      "UPS": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "VS": 0,
      "VSV": 0
    },
    "VS": {
      "VS": 17,
      "B2": 0,
      "B3": 1,
      "B4": 0,
      "UPS": 0,
      "VSV": 4
    },
    "VSV": {
      "VSV": 20,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VS": 2
    }
  },
  "failed": [
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt1_16_06_20_015_062447.76_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt2_16_06_12_018_017885.91_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt2_16_06_24_015_041349.09_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt2_16_07_04_023_207918.90_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt3_16_06_20_017_011470.47_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt3_16_06_20_017_007136.74_B4.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt7_16_07_07_017_074981.03_B4.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt5_16_06_15_047_013379.50_B3.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt5_16_06_19_071_156089.90_B3.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt5_16_07_12_021_2_337339.40_B3.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VSV_C_TO_Jt2_16_07_04_023_min226_000111.51_VSV.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VS_C_TO_Jt3_16_07_23_003_min13_000096.39_VS.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VS_C_TR_Jt5_16_06_21_008_min6_000042.89_VS.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt2_16_06_12_018_017999.06_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt3_16_06_18_006_042024.30_B2.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TO_Jt3_16_07_06_006_089672.23_B4.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt1_16_06_02_109_027392.23_B4.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt6_16_06_23_080_103281.90_B4.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt5_16_06_15_047_050256.48_B3.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/C_TR_Jt5_16_07_12_021_2_336955.00_B3.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VSV_C_TO_Jt3_16_07_11_009_min12_000074.80_VSV.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VS_C_TO_Jt2_16_06_26_010_min297_000009.92_VS.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VS_C_TO_Jt3_16_06_18_006_min13_000103.38_VS.htk",
    "simple_call_test/audio/label_fixed/sr500000_xpps5000_h512_wHam/hog/VS_C_TR_Jt5_16_06_19_071_min62_000028.43_VS.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:04:00.0, compute capability: 6.0, device: 1, name: Tesla P100-PCIE-12GB, pci bus id: 0000:05:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": true,
        "dataset_name": null
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 5000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 3
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "cnn_1d_sct_padded_nrs0xpps5000h512_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  494,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "conv1d_input"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d",
                "trainable": true,
                "batch_input_shape": [
                  null,
                  494,
                  288
                ],
                "dtype": "float32",
                "filters": 32,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_1",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_1",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_2",
                "trainable": true,
                "dtype": "float32",
                "filters": 64,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_2",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_3",
                "trainable": true,
                "dtype": "float32",
                "filters": 128,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_3",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_4",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_4",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Conv1D",
              "config": {
                "name": "conv1d_5",
                "trainable": true,
                "dtype": "float32",
                "filters": 256,
                "kernel_size": [
                  3
                ],
                "strides": [
                  1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                  1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "MaxPooling1D",
              "config": {
                "name": "max_pooling1d_5",
                "trainable": true,
                "dtype": "float32",
                "strides": [
                  2
                ],
                "pool_size": [
                  2
                ],
                "padding": "valid",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Flatten",
              "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 6,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": true,
              "dataset_name": null
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 5000,
              "height": 512,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 3
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_cnn_1d_sct_padded_nrs0xpps5000h512_hog_100/dca2ab62da7b68ef157cd66056013328da27a219/best_val_acc_e064_v0.803.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}