{
  "id": "nn_lstm_sct_vl_xpps4000_h256_hog_100/bfa291056fd1093d80ca9bef442fbf1901fb7fb0/rec/rec_164c4ab70d17e57fbfd43c21704601cdcd4eeef3_e60.report",
  "timestamp": "2020-12-22T10:58:50Z",
  "accuracy": 0.8712121212121212,
  "loss": 0.4735956723485869,
  "correct": 115,
  "incorrect": 17,
  "total": 132,
  "confusion": {
    "B2": {
      "B2": 18,
      "B3": 2,
      "B4": 2,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "B3": {
      "B3": 17,
      "B2": 5,
      "B4": 0,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "B4": {
      "B4": 17,
      "B2": 3,
      "B3": 0,
      "UPS": 2,
      "VS": 0,
      "VSV": 0
    },
    "UPS": {
      "UPS": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "VS": 0,
      "VSV": 0
    },
    "VS": {
      "VS": 19,
      "B2": 1,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VSV": 2
    },
    "VSV": {
      "VSV": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VS": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TO_Jt2_16_06_12_018_017999.06_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt1_16_06_02_109_027392.23_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt4_16_06_23_057_205774.30_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt5_16_06_23_025_077377.31_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt5_16_07_12_021_2_336955.00_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/VS_C_TO_Jt2_16_06_26_010_min297_000009.92_VS.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TO_Jt2_16_06_12_018_018106.82_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TO_Jt2_16_06_18_005_032169.37_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TO_Jt2_16_06_26_010_195566.10_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TO_Jt1_16_06_20_015_045959.73_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt6_16_07_12_017_175631.70_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt7_16_07_07_017_102207.50_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt5_16_06_21_008_068349.49_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt5_16_06_27_025_061551.00_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/C_TR_Jt5_16_07_12_021_2_337219.70_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/VS_C_TO_Jt2_16_06_24_015_min22_000039.90_VS.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps4000_h256_wHam/hog/VS_C_TR_Jt5_16_07_12_021_2_min98_000107.48_VS.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 4000,
        "height": 256,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 4
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "lstm_sct_vl_xpps4000_h256_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  null,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": true,
                "name": "input_1"
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 6,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "variable_length": true,
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": false,
              "dataset_name": null,
              "padded_left": false
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 4000,
              "height": 256,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 4
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_lstm_sct_vl_xpps4000_h256_hog_100/bfa291056fd1093d80ca9bef442fbf1901fb7fb0/best_val_acc_e060_v0.9091.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}