{
  "id": "nn_cnn_2d_sct_left_padded_nrs0xpps5000h512_hog_100/k-fold_a019-5ca7-5997-7811-a2dc-0371-7add-eca6/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-12-21T14:35:10Z",
  "val_acc_m": 0.8352272734375,
  "val_acc_d": 0.04164206218016267,
  "val_loss_m": 1.8199254274375,
  "val_loss_d": 0.3991943203060629,
  "test_acc_m": 0.7575757575757576,
  "test_acc_d": 0.04089706412920166,
  "test_loss_m": 1.0525634726781163,
  "test_loss_d": 0.37035522515883895,
  "epoch_m": 62.125,
  "epoch_d": 20.357080200404827,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": true,
        "dataset_name": null,
        "padded_left": true
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 5000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_2d_sct_left_padded_nrs0xpps5000h512_hog_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    494,
                    288,
                    1
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv2d_input"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    494,
                    288,
                    1
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 128,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_4",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 256,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_4",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 6,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {},
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": true,
                "dataset_name": null,
                "padded_left": true
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 5000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_cnn_2d_sct_left_padded_nrs0xpps5000h512_hog_100/a01941c70499c790fd04ac66214ac148da39db9b/best_val_acc_e031_v0.7727.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_left_padded"
        ]
      }
    }
  ],
  "val_acc": [
    0.7727272511,
    0.8939393759,
    0.8484848738,
    0.8484848738,
    0.8333333135,
    0.8787878752,
    0.7878788114,
    0.8181818128
  ],
  "val_loss": [
    1.4865965843,
    1.13828969,
    2.1775920391,
    1.764289856,
    2.1204946041,
    1.5402042866,
    2.147806406,
    2.1841299534
  ],
  "test_acc": [
    0.7727272727272727,
    0.7878787878787878,
    0.8106060606060606,
    0.7045454545454546,
    0.7954545454545454,
    0.7575757575757576,
    0.7196969696969697,
    0.7121212121212122
  ],
  "test_loss": [
    0.6195520873819471,
    1.0146346807512119,
    0.8433275924773845,
    0.7751034440871397,
    0.8536146983746163,
    1.1529244536733916,
    1.4340766527853712,
    1.7272741718938676
  ],
  "epoch": [
    31,
    85,
    45,
    44,
    58,
    80,
    79,
    75
  ]
}