{
  "id": "nn_lstm_sct_compressed_nrs0_raw_100/k-fold_7230-2be2-c080-14d6-dc82-c705-30e4-f2c6/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-12-31T09:54:05Z",
  "val_acc_m": 0.77187499405,
  "val_acc_d": 0.045193034106884196,
  "val_loss_m": 2.7243879437375,
  "val_loss_d": 1.2669924675335402,
  "test_acc_m": 0.6765625,
  "test_acc_d": 0.022596519169363855,
  "test_loss_m": 1.2326264333800692,
  "test_loss_d": 0.5191350932279085,
  "epoch_m": 27.75,
  "epoch_d": 18.460382289804137,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractPixelsTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "lstm_sct_compressed_nrs0_raw_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    null,
                    256
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": true,
                  "name": "input_1"
                }
              },
              {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout_1",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_2",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 4,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "DurationLengthFilter",
              "props": {
                "min_duration_length": 0.022
              }
            },
            {
              "task": "MinCountLabelFilter",
              "props": {
                "min_count": 50
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": false,
                "dataset_name": null,
                "padded_left": false
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "width": 100,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractPixelsTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_lstm_sct_compressed_nrs0_raw_100/72304d836ad5d2c6e3bc183d21bb4aac1bfd9db6/best_val_acc_e027_v0.75.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_compressed"
        ]
      }
    }
  ],
  "val_acc": [
    0.75,
    0.7250000238,
    0.7749999762,
    0.8249999881,
    0.7749999762,
    0.8249999881,
    0.8000000119,
    0.6999999881
  ],
  "val_loss": [
    3.2672150135,
    5.2884478569,
    2.6607439518,
    2.5572533607,
    1.4780035019,
    3.2945232391,
    1.4873058796,
    1.7616107464
  ],
  "test_acc": [
    0.6625,
    0.675,
    0.7125,
    0.6875,
    0.7,
    0.675,
    0.65,
    0.65
  ],
  "test_loss": [
    1.577990080561971,
    2.105002071374668,
    0.786593909351744,
    1.2618355884923775,
    0.7026690546540095,
    1.712532260933036,
    0.7755482117836976,
    0.938840289889049
  ],
  "epoch": [
    27,
    61,
    16,
    37,
    10,
    45,
    15,
    11
  ]
}