{
  "id": "nn_lstm_sct_compressed_nrs0_hog_100/657c49a629a6cb8ac9f748a56cf696a2e7bbfe00/rec/rec_ed19dbb5c82ec44ecc9cd3c216c140a14e642fc4_e47.report",
  "timestamp": "2020-12-29T20:43:58Z",
  "accuracy": 0.8,
  "loss": 0.591921313911931,
  "correct": 64,
  "incorrect": 16,
  "total": 80,
  "confusion": {
    "B2": {
      "B2": 10,
      "B3": 3,
      "B4": 7,
      "UPS": 0
    },
    "B3": {
      "B3": 14,
      "B2": 5,
      "B4": 1,
      "UPS": 0
    },
    "B4": {
      "B4": 20,
      "B2": 0,
      "B3": 0,
      "UPS": 0
    },
    "UPS": {
      "UPS": 20,
      "B2": 0,
      "B3": 0,
      "B4": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/B2_C_TR_Jt2_16_06_02_044_000187.48_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt1_16_06_20_015_062571.36_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_25_016_029926.02_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_07_04_023_185784.60_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_07_06_015_115042.50_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt1_16_06_07_058_000797.01_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt4_16_06_23_057_154843.80_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/B2_C_TR_Jt2_16_06_02_044_000306.76_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt1_16_06_20_015_062447.76_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_20_018_046973.78_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_26_010_148460.60_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TO_Jt2_16_07_04_023_185898.80_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_15_047_013379.50_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_19_071_156089.90_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_23_025_077217.57_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_w100_wHam/hog/C_TR_Jt5_16_07_12_021_2_337339.40_B3.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 2
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "lstm_sct_compressed_nrs0_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  null,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": true,
                "name": "input_1"
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 4,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": false,
              "dataset_name": null,
              "padded_left": false
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 2
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_lstm_sct_compressed_nrs0_hog_100/657c49a629a6cb8ac9f748a56cf696a2e7bbfe00/best_val_acc_e047_v0.825.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}