{
  "id": "nn_cnn_1d_sct_compressed_nrs24_raw_100/k-fold_ef52-3e29-af2e-b7eb-ebca-afb6-58e8-242b/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-12-31T09:54:47Z",
  "val_acc_m": 0.8749999925625,
  "val_acc_d": 0.056694673200275485,
  "val_loss_m": 1.184284176675,
  "val_loss_d": 0.5657438037420178,
  "test_acc_m": 0.8125,
  "test_acc_d": 0.060871644818068955,
  "test_loss_m": 0.6289037748596957,
  "test_loss_d": 0.27437196064807096,
  "epoch_m": 47.875,
  "epoch_d": 18.200765290032646,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:04:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 24,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.3
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractPixelsTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_1d_sct_compressed_nrs24_raw_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    100,
                    256
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv1d_input"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    100,
                    256
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv1D",
                "config": {
                  "name": "conv1d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 128,
                  "kernel_size": [
                    3
                  ],
                  "strides": [
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling1D",
                "config": {
                  "name": "max_pooling1d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "strides": [
                    2
                  ],
                  "pool_size": [
                    2
                  ],
                  "padding": "valid",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 4,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "run",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "DurationLengthFilter",
              "props": {
                "min_duration_length": 0.022
              }
            },
            {
              "task": "MinCountLabelFilter",
              "props": {
                "min_count": 50
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": false,
                "dataset_name": null,
                "padded_left": false
              }
            },
            {
              "task": "NoiseReduceTask",
              "props": {
                "sensitivity": 24,
                "noise": [
                  {
                    "task": "AudioLoadTask",
                    "props": {
                      "mdb": "simple_call_test/metadata.json",
                      "dataset_name": "simple_call_test",
                      "source": "simple_call_test/audio"
                    }
                  },
                  {
                    "task": "DurationLengthFilter",
                    "props": {
                      "min_duration_length": 0.022
                    }
                  },
                  {
                    "task": "MinCountLabelFilter",
                    "props": {
                      "min_count": 50
                    }
                  },
                  {
                    "task": "SilentAudioTask",
                    "props": {
                      "max_length": 0.3
                    }
                  },
                  {
                    "task": "NoiseProfileTask",
                    "props": {}
                  }
                ]
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "width": 100,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractPixelsTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_cnn_1d_sct_compressed_nrs24_raw_100/ef52134ede3e78c0b54a7398543b07208ee8aba7/best_val_acc_e048_v0.875.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_compressed"
        ]
      }
    }
  ],
  "val_acc": [
    0.875,
    0.8500000238,
    0.8249999881,
    0.9499999881,
    0.8999999762,
    0.8999999762,
    0.9250000119,
    0.7749999762
  ],
  "val_loss": [
    1.9384248257,
    0.9395946264,
    1.7609876394,
    0.4170013368,
    0.6980881095,
    1.2932235003,
    0.7441193461,
    1.6828340292
  ],
  "test_acc": [
    0.775,
    0.8875,
    0.8875,
    0.85,
    0.825,
    0.75,
    0.725,
    0.8
  ],
  "test_loss": [
    0.6751193947766982,
    0.37813212738069524,
    0.4647339300482717,
    0.3967963258668782,
    0.4444996158636119,
    0.5981066304064029,
    0.9556736608727265,
    1.1181685136622808
  ],
  "epoch": [
    48,
    27,
    39,
    48,
    44,
    31,
    84,
    62
  ]
}