{
  "id": "nn_lstm_sct_padded_nrs6xpps5000h512_raw_100/k-fold_aac2-6064-0c99-f364-4afc-5b5b-0594-36c1/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-11T16:16:01Z",
  "val_acc_m": 0.4412878789125,
  "val_acc_d": 0.09214081906717159,
  "val_loss_m": 2.3545229583875,
  "val_loss_d": 0.41699964862647704,
  "test_acc_m": 0.39867424242424243,
  "test_acc_d": 0.07059666576293643,
  "test_loss_m": 1.4011114025968632,
  "test_loss_d": 0.21193739624349434,
  "epoch_m": 70.5,
  "epoch_d": 26.928476695551442,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:83:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": true,
        "dataset_name": null
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 6,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.2004000000000019
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 5000,
        "height": 512,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractPixelsTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "lstm_sct_padded_nrs6xpps5000h512_raw_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    null,
                    512
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": true,
                  "name": "input_1"
                }
              },
              {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "gain": 1.0,
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout_1",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_2",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 6,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {
            "add_dim": false
          },
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": true,
                "dataset_name": null
              }
            },
            {
              "task": "NoiseReduceTask",
              "props": {
                "sensitivity": 6,
                "noise": [
                  {
                    "task": "AudioLoadTask",
                    "props": {
                      "mdb": "simple_call_test/metadata.json",
                      "dataset_name": "simple_call_test",
                      "source": "simple_call_test/audio"
                    }
                  },
                  {
                    "task": "SilentAudioTask",
                    "props": {
                      "max_length": 0.2004000000000019
                    }
                  },
                  {
                    "task": "NoiseProfileTask",
                    "props": {}
                  }
                ]
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 5000,
                "height": 512,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractPixelsTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_lstm_sct_padded_nrs6xpps5000h512_raw_100/aac2c5779c0ca6ad7e6877a8029a83261fc85170/best_val_acc_e066_v0.4242.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_padded"
        ]
      }
    }
  ],
  "val_acc": [
    0.4242424369,
    0.6515151262,
    0.3787878752,
    0.3787878752,
    0.4242424369,
    0.3787878752,
    0.4848484993,
    0.4090909064
  ],
  "val_loss": [
    2.4422037601,
    1.7557349205,
    2.5916175842,
    2.6255366802,
    2.4997937679,
    2.5842413902,
    1.6308192015,
    2.7062363625
  ],
  "test_acc": [
    0.36363636363636365,
    0.5454545454545454,
    0.3560606060606061,
    0.3712121212121212,
    0.3712121212121212,
    0.36363636363636365,
    0.4696969696969697,
    0.3484848484848485
  ],
  "test_loss": [
    1.4701701068071558,
    1.0902242238340532,
    1.5691605099248618,
    1.5590452123303817,
    1.4415972008772024,
    1.52192708261304,
    1.0402040420784473,
    1.5165628423097641
  ],
  "epoch": [
    66,
    99,
    99,
    74,
    38,
    30,
    96,
    62
  ]
}