{
  "id": "nn_lstm_sct_vl_xpps5000_h300_hog_100/615d52313cc4b8e26b95cc3ad4219c73fb375151/rec/rec_091bbd82533e945f56fd65471501f57d03fd0ad9_e38.report",
  "timestamp": "2020-11-12T12:18:10Z",
  "accuracy": 0.8257575757575758,
  "loss": 0.5403618922401382,
  "correct": 109,
  "incorrect": 23,
  "total": 132,
  "confusion": {
    "B2": {
      "B2": 18,
      "B3": 0,
      "B4": 3,
      "UPS": 1,
      "VS": 0,
      "VSV": 0
    },
    "B3": {
      "B3": 18,
      "B2": 4,
      "B4": 0,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "B4": {
      "B4": 7,
      "B2": 10,
      "B3": 0,
      "UPS": 2,
      "VS": 3,
      "VSV": 0
    },
    "UPS": {
      "UPS": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "VS": 0,
      "VSV": 0
    },
    "VS": {
      "VS": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VSV": 0
    },
    "VSV": {
      "VSV": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VS": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt2_16_06_25_016_029581.37_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt2_16_07_04_023_185784.60_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/B2_C_TR_Jt1_16_06_02_018_000129.77_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt1_16_06_20_029_360101.50_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt1_16_06_02_109_004553.61_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt1_16_06_02_109_032255.71_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt4_16_06_11_013_161915.30_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt6_16_06_19_076_003228.97_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt3_16_07_11_009_297870.00_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt1_16_06_20_029_475471.50_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt2_16_07_04_023_185898.80_B2.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/B4_C_TR_Jt1_16_06_02_108_000129.77_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt1_16_06_20_029_360305.30_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt2_16_06_25_016_015005.03_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt3_16_07_09_018_037976.91_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt1_16_06_02_109_017181.54_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt1_16_06_02_109_032500.79_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt6_16_06_19_076_002539.58_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt7_16_06_17_023_009188.70_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt7_16_07_10_009_014775.79_B4.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TO_Jt3_16_06_20_017_012145.27_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt4_16_06_25_005_061776.26_B3.htk",
    "simple_call_test/audio/label_variable/sr500000_xpps5000_h300_wHam/hog/C_TR_Jt5_16_06_19_071_116232.30_B3.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: GeForce RTX 2080 Ti, pci bus id: 0000:40:00.0, compute capability: 7.5"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 5000,
        "height": 300,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 7
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "lstm_sct_vl_xpps5000_h300_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  null,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": true,
                "name": "input_1"
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 6,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "variable_length": true,
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": false,
              "dataset_name": null
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 5000,
              "height": 300,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 7
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_lstm_sct_vl_xpps5000_h300_hog_100/615d52313cc4b8e26b95cc3ad4219c73fb375151/best_val_acc_e038_v0.9242.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}