{
  "id": "nn_cnn_2d_sct_compressed_nrs0_hog_100/k-fold_d4cf-2041-657c-7e08-1ba3-f74c-3621-cf83/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-12-31T09:54:07Z",
  "val_acc_m": 0.8656250014875,
  "val_acc_d": 0.0549959455624128,
  "val_loss_m": 1.3040512576625,
  "val_loss_d": 1.0273360191069068,
  "test_acc_m": 0.7921875,
  "test_acc_d": 0.04626085779885319,
  "test_loss_m": 0.5611477068228943,
  "test_loss_d": 0.14481918737789243,
  "epoch_m": 31.375,
  "epoch_d": 18.28299365921394,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:84:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_2d_sct_compressed_nrs0_hog_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    43,
                    288,
                    1
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv2d_input"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    43,
                    288,
                    1
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 4,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {},
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "DurationLengthFilter",
              "props": {
                "min_duration_length": 0.022
              }
            },
            {
              "task": "MinCountLabelFilter",
              "props": {
                "min_count": 50
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": false,
                "dataset_name": null,
                "padded_left": false
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "width": 100,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractHOGHWRecogTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_cnn_2d_sct_compressed_nrs0_hog_100/d4cf57eb474905f9db51689ed519cd330589a849/best_val_acc_e032_v0.875.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_compressed"
        ]
      }
    }
  ],
  "val_acc": [
    0.875,
    0.9250000119,
    0.8500000238,
    0.8999999762,
    0.8000000119,
    0.875,
    0.9250000119,
    0.7749999762
  ],
  "val_loss": [
    1.0142802,
    0.9004796743,
    1.0873651505,
    0.7750506997,
    0.9914623499,
    1.1417834759,
    0.7023440599,
    3.8196444511
  ],
  "test_acc": [
    0.7875,
    0.8,
    0.8,
    0.825,
    0.8625,
    0.7875,
    0.775,
    0.7
  ],
  "test_loss": [
    0.5150980297499643,
    0.5215000546496575,
    0.5014679718742855,
    0.47174151018687666,
    0.42662426099963113,
    0.5608861240536698,
    0.5956428878472565,
    0.8962208152218125
  ],
  "epoch": [
    32,
    37,
    20,
    24,
    20,
    21,
    23,
    74
  ]
}