{
  "id": "nn_lstm_sct_compressed_nrs6_hog_100/f3e4c4c22874faea4fcbd7a3057c982748ca255c/rec/rec_1fb5f79b6822ec3a707978646ed45b9e176be71e_e54.report",
  "timestamp": "2020-12-29T20:43:47Z",
  "accuracy": 0.725,
  "loss": 1.0366517799864032,
  "correct": 58,
  "incorrect": 22,
  "total": 80,
  "confusion": {
    "B2": {
      "B2": 16,
      "B3": 3,
      "B4": 0,
      "UPS": 1
    },
    "B3": {
      "B3": 7,
      "B2": 11,
      "B4": 0,
      "UPS": 2
    },
    "B4": {
      "B4": 15,
      "B2": 3,
      "B3": 0,
      "UPS": 2
    },
    "UPS": {
      "UPS": 20,
      "B2": 0,
      "B3": 0,
      "B4": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_25_016_029926.02_B2.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_07_06_006_089672.23_B4.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_07_11_009_337328.00_B4.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt7_16_07_12_020_153369.70_B4.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_26_010_301625.10_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_18_006_076088.89_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_24_017_066505.13_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt4_16_06_23_057_154843.80_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt4_16_06_25_005_061631.15_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_23_025_082606.90_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt5_16_07_12_021_2_254170.30_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_12_018_017885.91_B2.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt2_16_06_12_018_048834.57_B2.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_20_017_007321.50_B2.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt6_16_06_19_077_038310.63_B4.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt7_16_07_12_020_153616.60_B4.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_06_18_007_001985.61_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TO_Jt3_16_07_06_006_225073.80_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt1_16_06_07_058_086450.62_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_19_071_156089.90_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt5_16_06_23_025_077217.57_B3.htk",
    "simple_call_test/audio/label_variable/nr6/sr500000_w100_wHam/hog/C_TR_Jt5_16_07_12_021_2_337339.40_B3.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:87:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "DurationLengthFilter",
      "props": {
        "min_duration_length": 0.022
      }
    },
    {
      "task": "MinCountLabelFilter",
      "props": {
        "min_count": 50
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": false,
        "dataset_name": null,
        "padded_left": false
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 6,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.3
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "width": 100,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 2
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "lstm_sct_compressed_nrs6_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  null,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": true,
                "name": "input_1"
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 4,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "DurationLengthFilter",
            "props": {
              "min_duration_length": 0.022
            }
          },
          {
            "task": "MinCountLabelFilter",
            "props": {
              "min_count": 50
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": false,
              "dataset_name": null,
              "padded_left": false
            }
          },
          {
            "task": "NoiseReduceTask",
            "props": {
              "sensitivity": 6,
              "noise": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "DurationLengthFilter",
                  "props": {
                    "min_duration_length": 0.022
                  }
                },
                {
                  "task": "MinCountLabelFilter",
                  "props": {
                    "min_count": 50
                  }
                },
                {
                  "task": "SilentAudioTask",
                  "props": {
                    "max_length": 0.3
                  }
                },
                {
                  "task": "NoiseProfileTask",
                  "props": {}
                }
              ]
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "width": 100,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 2
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_lstm_sct_compressed_nrs6_hog_100/f3e4c4c22874faea4fcbd7a3057c982748ca255c/best_val_acc_e054_v0.825.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}