{
  "id": "nn_lstm_sct_left_padded_nrs6xpps2000h256_hog_100/9f93e0b512883e855060309dfb5b4aec0561fdc0/rec/rec_96babfb928dcc9548d9ea258732274a0a608e044_e38.report",
  "timestamp": "2020-12-21T18:02:03Z",
  "accuracy": 0.8560606060606061,
  "loss": 0.6508064049230123,
  "correct": 113,
  "incorrect": 19,
  "total": 132,
  "confusion": {
    "B2": {
      "B2": 19,
      "B3": 1,
      "B4": 1,
      "UPS": 1,
      "VS": 0,
      "VSV": 0
    },
    "B3": {
      "B3": 14,
      "B2": 6,
      "B4": 0,
      "UPS": 1,
      "VS": 0,
      "VSV": 1
    },
    "B4": {
      "B4": 18,
      "B2": 4,
      "B3": 0,
      "UPS": 0,
      "VS": 0,
      "VSV": 0
    },
    "UPS": {
      "UPS": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "VS": 0,
      "VSV": 0
    },
    "VS": {
      "VS": 18,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VSV": 4
    },
    "VSV": {
      "VSV": 22,
      "B2": 0,
      "B3": 0,
      "B4": 0,
      "UPS": 0,
      "VS": 0
    }
  },
  "failed": [
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/B2_C_TR_Jt5_16_07_10_034_000707.77_B2.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TO_Jt2_16_06_20_018_051073.91_B4.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt6_16_07_12_017_175833.90_B4.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TO_Jt3_16_06_20_017_006909.42_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TO_Jt3_16_07_11_009_298654.10_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt4_16_06_19_013_012027.60_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt6_16_06_23_078_091373.05_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/VS_C_B_Jto_16_07_04_035_000208.88_VS.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/VS_C_TO_Jt3_16_07_11_009_min158_000031.49_VS.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/VS_C_TR_Jt4_16_06_15_043_min23_000061.00_VS.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/B2_C_B_Jt1_16_07_06_042_000693.63_B2.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TO_Jt2_16_07_04_023_185784.60_B2.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt6_16_06_19_076_003228.97_B4.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt7_16_07_10_009_003873.68_B4.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TO_Jt3_16_07_11_009_297870.00_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt5_16_06_21_008_068979.69_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt5_16_06_27_025_062044.97_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/C_TR_Jt6_16_06_15_016_038633.63_B3.htk",
    "simple_call_test/audio/label_fixed_left/nr6/sr500000_xpps2000_h256_wHam/hog/VS_C_TR_Jt1_16_06_07_057_min133_000031.54_VS.htk"
  ],
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:88:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": true,
        "dataset_name": null,
        "padded_left": true
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 6,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.2004000000000019
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 2000,
        "height": 256,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractHOGHWRecogTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2,
        "n": 6
      }
    },
    {
      "task": "CreateNNModelTask",
      "props": {
        "name": "lstm_sct_left_padded_nrs6xpps2000h256_hog_100",
        "model": {
          "name": "sequential",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [
                  null,
                  null,
                  288
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": true,
                "name": "input_1"
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_1",
                "trainable": true,
                "dtype": "float32",
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "time_major": false,
                "units": 256,
                "activation": "tanh",
                "recurrent_activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1.0,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": 2
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_1",
                "trainable": true,
                "dtype": "float32",
                "units": 1024,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.5,
                "noise_shape": null,
                "seed": null
              }
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "dense_2",
                "trainable": true,
                "dtype": "float32",
                "units": 6,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              }
            }
          ]
        },
        "prepare_args": {
          "add_dim": false
        },
        "fit_args": null
      }
    },
    {
      "task": "TrainNNModelTask",
      "props": {
        "epochs": 100,
        "save_every": 100
      }
    },
    {
      "task": "RecognizeNNTask",
      "props": {
        "validate": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "ExtractLabelPartsTask",
            "props": {
              "fixed_length": true,
              "dataset_name": null,
              "padded_left": true
            }
          },
          {
            "task": "NoiseReduceTask",
            "props": {
              "sensitivity": 6,
              "noise": [
                {
                  "task": "AudioLoadTask",
                  "props": {
                    "mdb": "simple_call_test/metadata.json",
                    "dataset_name": "simple_call_test",
                    "source": "simple_call_test/audio"
                  }
                },
                {
                  "task": "SilentAudioTask",
                  "props": {
                    "max_length": 0.2004000000000019
                  }
                },
                {
                  "task": "NoiseProfileTask",
                  "props": {}
                }
              ]
            }
          },
          {
            "task": "CreateSpectrogramTask",
            "props": {
              "sampling_rate": 500000,
              "x_pixels_per_sec": 2000,
              "height": 256,
              "window": "Ham"
            }
          },
          {
            "task": "ExtractHOGHWRecogTask",
            "props": {}
          },
          {
            "task": "KFoldSeparationTask",
            "props": {
              "k": 8,
              "val_bins": 1,
              "test_bins": 2,
              "n": 6
            }
          }
        ],
        "model_path": "simple_call_test/models/nn_lstm_sct_left_padded_nrs6xpps2000h256_hog_100/9f93e0b512883e855060309dfb5b4aec0561fdc0/best_val_acc_e038_v0.8788.h5"
      }
    },
    {
      "task": "ExtractionJSONTask",
      "props": {
        "report_name": []
      }
    }
  ]
}