{
  "id": "nn_cnn_2d_sct_padded_nrs6xpps2000h256_raw_100/k-fold_6b12-f1e0-68d5-b9ba-1b3b-8482-6e0a-6185/rec_k8_v1t2_e100_bva.report",
  "timestamp": "2020-11-11T15:54:04Z",
  "val_acc_m": 0.8617424294625,
  "val_acc_d": 0.037498098849469086,
  "val_loss_m": 2.0309548676125,
  "val_loss_d": 0.7333929987457584,
  "test_acc_m": 0.7992424242424242,
  "test_acc_d": 0.0316269246671049,
  "test_loss_m": 1.0267056768484335,
  "test_loss_d": 0.34348859148405303,
  "epoch_m": 76.375,
  "epoch_d": 25.241335146937057,
  "env": {
    "os": "Linux",
    "platform": "Linux-3.10.0-1127.19.1.el7.x86_64-x86_64-with-glibc2.10",
    "sox": "14.4.2",
    "java": [
      "openjdk version \"1.8.0_262\"",
      "OpenJDK Runtime Environment (build 1.8.0_262-b10)",
      "OpenJDK 64-Bit Server VM (build 25.262-b10, mixed mode)"
    ],
    "keras": "2.4.0",
    "tf": "2.3.1",
    "gpu": "device: 0, name: Tesla P100-PCIE-12GB, pci bus id: 0000:09:00.0, compute capability: 6.0"
  },
  "pipeline": [
    {
      "task": "AudioLoadTask",
      "props": {
        "mdb": "simple_call_test/metadata.json",
        "dataset_name": "simple_call_test",
        "source": "simple_call_test/audio"
      }
    },
    {
      "task": "ExtractLabelPartsTask",
      "props": {
        "fixed_length": true,
        "dataset_name": null
      }
    },
    {
      "task": "NoiseReduceTask",
      "props": {
        "sensitivity": 6,
        "noise": [
          {
            "task": "AudioLoadTask",
            "props": {
              "mdb": "simple_call_test/metadata.json",
              "dataset_name": "simple_call_test",
              "source": "simple_call_test/audio"
            }
          },
          {
            "task": "SilentAudioTask",
            "props": {
              "max_length": 0.2004000000000019
            }
          },
          {
            "task": "NoiseProfileTask",
            "props": {}
          }
        ]
      }
    },
    {
      "task": "CreateSpectrogramTask",
      "props": {
        "sampling_rate": 500000,
        "x_pixels_per_sec": 2000,
        "height": 256,
        "window": "Ham"
      }
    },
    {
      "task": "ExtractPixelsTask",
      "props": {}
    },
    {
      "task": "KFoldSeparationTask",
      "props": {
        "k": 8,
        "val_bins": 1,
        "test_bins": 2
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "create_nn_model",
        "kwargs": {
          "name": "cnn_2d_sct_padded_nrs6xpps2000h256_raw_100",
          "model": {
            "name": "sequential",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    397,
                    256,
                    1
                  ],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "conv2d_input"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d",
                  "trainable": true,
                  "batch_input_shape": [
                    null,
                    397,
                    256,
                    1
                  ],
                  "dtype": "float32",
                  "filters": 32,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_1",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 64,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_2",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 128,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_3",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Conv2D",
                "config": {
                  "name": "conv2d_4",
                  "trainable": true,
                  "dtype": "float32",
                  "filters": 256,
                  "kernel_size": [
                    3,
                    3
                  ],
                  "strides": [
                    1,
                    1
                  ],
                  "padding": "valid",
                  "data_format": "channels_last",
                  "dilation_rate": [
                    1,
                    1
                  ],
                  "groups": 1,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "MaxPooling2D",
                "config": {
                  "name": "max_pooling2d_4",
                  "trainable": true,
                  "dtype": "float32",
                  "pool_size": [
                    2,
                    2
                  ],
                  "padding": "valid",
                  "strides": [
                    2,
                    2
                  ],
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Flatten",
                "config": {
                  "name": "flatten",
                  "trainable": true,
                  "dtype": "float32",
                  "data_format": "channels_last"
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1024,
                  "activation": "relu",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              },
              {
                "class_name": "Dropout",
                "config": {
                  "name": "dropout",
                  "trainable": true,
                  "dtype": "float32",
                  "rate": 0.5,
                  "noise_shape": null,
                  "seed": null
                }
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense_1",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 6,
                  "activation": "softmax",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                }
              }
            ]
          },
          "prepare_args": {},
          "fit_args": null
        },
        "pfl_suffix": "",
        "pfl_inject": {
          "validate": "val"
        }
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "train",
        "kwargs": {
          "epochs": 100,
          "save_every": 100
        },
        "pfl_suffix": "_e100",
        "pfl_inject": {}
      }
    },
    {
      "task": "ParallelTask",
      "props": {
        "action": "recognize_best_val_acc",
        "kwargs": {
          "validate": [
            {
              "task": "AudioLoadTask",
              "props": {
                "mdb": "simple_call_test/metadata.json",
                "dataset_name": "simple_call_test",
                "source": "simple_call_test/audio"
              }
            },
            {
              "task": "ExtractLabelPartsTask",
              "props": {
                "fixed_length": true,
                "dataset_name": null
              }
            },
            {
              "task": "NoiseReduceTask",
              "props": {
                "sensitivity": 6,
                "noise": [
                  {
                    "task": "AudioLoadTask",
                    "props": {
                      "mdb": "simple_call_test/metadata.json",
                      "dataset_name": "simple_call_test",
                      "source": "simple_call_test/audio"
                    }
                  },
                  {
                    "task": "SilentAudioTask",
                    "props": {
                      "max_length": 0.2004000000000019
                    }
                  },
                  {
                    "task": "NoiseProfileTask",
                    "props": {}
                  }
                ]
              }
            },
            {
              "task": "CreateSpectrogramTask",
              "props": {
                "sampling_rate": 500000,
                "x_pixels_per_sec": 2000,
                "height": 256,
                "window": "Ham"
              }
            },
            {
              "task": "ExtractPixelsTask",
              "props": {}
            },
            {
              "task": "KFoldSeparationTask",
              "props": {
                "k": 8,
                "val_bins": 1,
                "test_bins": 2,
                "n": 0
              }
            }
          ],
          "model_path": "simple_call_test/models/nn_cnn_2d_sct_padded_nrs6xpps2000h256_raw_100/6b12298e35fc7d439747cddda5ee1a87d3f36533/best_val_acc_e094_v0.8182.h5"
        },
        "pfl_suffix": "_bva",
        "pfl_inject": {
          "testing": "test"
        }
      }
    },
    {
      "task": "KFoldNNMergingTask",
      "props": {
        "report_name": [
          "testing_sct_padded"
        ]
      }
    }
  ],
  "val_acc": [
    0.8181818128,
    0.8484848738,
    0.9242424369,
    0.8636363745,
    0.8333333135,
    0.8333333135,
    0.8636363745,
    0.9090909362
  ],
  "val_loss": [
    3.4230995178,
    2.4721839428,
    1.5152668953,
    1.5810155869,
    1.7685130835,
    1.1476666927,
    1.7983173132,
    2.5415759087
  ],
  "test_acc": [
    0.7727272727272727,
    0.8106060606060606,
    0.8560606060606061,
    0.7954545454545454,
    0.8181818181818182,
    0.803030303030303,
    0.7878787878787878,
    0.75
  ],
  "test_loss": [
    1.4697495792324893,
    1.0596342916616113,
    0.7420295821288058,
    0.7603858157210008,
    0.6235154743805787,
    1.2951941866064067,
    0.7999726964869702,
    1.4631637885696056
  ],
  "epoch": [
    94,
    92,
    92,
    86,
    48,
    100,
    30,
    69
  ]
}